EDT/УТ/src/InformationRegisters/экУчетПроизводственныхОпераций/экУчетПроизводственныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>экУчетПроизводственныхОпераций</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.экВидыПроизводственныхОпераций</types>
    </type>
  </resources>
  <resources>
    <name>ВесПроизводственнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбратныйПоток</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.экСтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/экВесаПроизводственныхОпераций/экВесаПроизводственныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>экВесаПроизводственныхОпераций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВесПроизводственнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПроизводственнойОперации</name>
    <type>
      <types>CatalogRef.экВидыПроизводственныхОпераций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/экУчетПроизводственныхОпераций/ManagerModule.bsl
Функция ПолучитьТаблицуДвижений(Запрос) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерТаблицИсходныхДанных;
	Запрос.Текст = Запрос.Текст +
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" +
	"ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Период КАК Период,
	|	ВТ_ИсходныеДанные.ВидОперации КАК ВидОперации,
	|	МАКСИМУМ(экВесаПроизводственныхОпераций.Период) КАК ПериодВеса
	|ПОМЕСТИТЬ ВТ_ПериодыВеса
	|ИЗ
	|	РегистрСведений.экВесаПроизводственныхОпераций КАК экВесаПроизводственныхОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ПО экВесаПроизводственныхОпераций.Период <= ВТ_ИсходныеДанные.Период
	|			И экВесаПроизводственныхОпераций.ВидПроизводственнойОперации = ВТ_ИсходныеДанные.ВидОперации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Период,
	|	ВТ_ИсходныеДанные.ВидОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Период КАК Период,
	|	ВТ_ИсходныеДанные.Заказ КАК Заказ,
	|	ВТ_ИсходныеДанные.Регион КАК Регион,
	|	экВидыПроизводственныхОпераций.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_ИсходныеДанные.ВидОперации КАК ВидОперации,
	|	ВТ_ИсходныеДанные.ОбратныйПоток КАК ОбратныйПоток,
	|	ЕСТЬNULL(экВесаПроизводственныхОпераций.ВесПроизводственнойОперации, 1) КАК ВесПроизводственнойОперации
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыВеса КАК ВТ_ПериодыВеса
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.экВесаПроизводственныхОпераций КАК экВесаПроизводственныхОпераций
	|			ПО ВТ_ПериодыВеса.ПериодВеса = экВесаПроизводственныхОпераций.Период
	|				И ВТ_ПериодыВеса.ВидОперации = экВесаПроизводственныхОпераций.ВидПроизводственнойОперации
	|		ПО ВТ_ИсходныеДанные.Период = ВТ_ПериодыВеса.Период
	|			И ВТ_ИсходныеДанные.ВидОперации = ВТ_ПериодыВеса.ВидОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.экВидыПроизводственныхОпераций КАК экВидыПроизводственныхОпераций
	|		ПО ВТ_ИсходныеДанные.ВидОперации = экВидыПроизводственныхОпераций.Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
